_posts/2023-08-18-backend_dev_job_howto.html
---
layout: blogpost
title: "Want to get a job as a backend developer? - Learn these topics now!"
tags: programming career java enterprise
related_tags_count: 1
preview_image: assets/img/backenddev/backend.png
---


<p>
Sometimes I get questions on how to learn the skills necessary to get a backend programmer job. That is exactly my aim for this article: to give you a set of terms, keywords and knowledge to get started on your journey. My hope is that you know what you need to learn after reading on.
</p>



<p>
I originally got the idea for an article like this after some minor contributions to <a href="https://koding.no/">Koding.no</a>. Koding.no is a Norwegian resource to help self thought programmers find resources, learn key topics, get a structure to their learning and more. If you can read Norwegian, I think the site might be a great deal of help to you if you are currently learning software development on your own. Feel free to contribute if you can as well :) 
</p>


<p>
Who am I to write this? I have programmed since my teens, and have also worked for many years in a big enterprise. I have interviewed people, coordinated people, and worked as a backend developer myself. Programming conferences, talking to people and reading online has also formed my opinion. That being said, some people might disagree. Like all lists of this kind, it is formed by opinion.
</p>


<p>
If you are already a backend developer, and are looking to level up your skills, I have <a href="https://themkat.net/2020/09/07/career_boosting_books.html">a list of recommended books</a>. It is Java flavored, but several of the books are useful to other people as well. The books cover some of what I write about below, and you might want to have a look even if you are fairly fresh to the world of backend development.
</p>



<div id="outline-container-org0c98d57" class="outline-2">
<h2 id="org0c98d57">Target audience</h2>
<div class="outline-text-2" id="text-org0c98d57">
<p>
My target audience is people who want to work professionally as a backend developer. This can include both beginners as well as people transitioning from a different area of expertise. I expect you to now be completely new to computers however, so if you are very new, you may find parts of this article confusing. Take it one step at a time, and I'm sure you will figure it out :) Start with learning a programming language and general programming concepts in that case.
</p>
</div>
</div>



<div id="outline-container-orgff2a7d4" class="outline-2">
<h2 id="orgff2a7d4">How this article is structured</h2>
<div class="outline-text-2" id="text-orgff2a7d4">
<p>
This article contains information about what to search for and learn, and will not have in-depth explanations. An article covering everything would be too much, and would probably fit better as a book. My hope is that you at least get some guidance on where to start, terms to look up, and other research topics to help you become a backend developer. (or if you are already, become even better at it!).
</p>


<p>
I have put the learning tips into 3 sections:
</p>
<ul class="org-ul">
<li><b>1. Complete basics:</b> These are the complete basics of knowledge, and can in a way be considered prerequisites for the rest. You should know as much of these are possible.</li>
<li><b>2. Next steps - The bread and butter:</b> These topics contain the bread and butter of the knowledge you use daily. To get a job within the field, you should at least know some of them.</li>
<li><b>3. Going a bit above and beyond:</b> sdfsd</li>
</ul>


<p>
Don't worry if you get a job and don't know everything in number 2 and 3! You will probably also learn some of these on the job while working. Knowing at least some of them will help you get in the door though, and the more the better if there are stiff competition!
</p>


<p>
Before we begin on those, there is a general tips section with tips for everyone (no matter their skill level).
</p>
</div>
</div>


<div id="outline-container-org4458786" class="outline-2">
<h2 id="org4458786">General tips</h2>
<div class="outline-text-2" id="text-org4458786">
<p>
There are some general tips that apply no matter your skill level. Even if you are experienced, you can find great joy in following some of these tips if you are not already.
</p>

<ul class="org-ul">
<li><b>Have an active Github, Gitlab or similar account for sharing code.</b> This is even more important if you are self thought, or want to get into a field where you do not have an education. Just having some small toy projects shows that you know how to make basic things. Helping out in open source projects can also be very useful, as it can show potential employers that you can collaborate with others. (visible through review comments, discussions etc.).</li>
<li><b>Learn patterns, not just the latest technology.</b> I have seen this again and again. Many developers seem very interested in X and Y technology, but doesn't seem to learn the patterns behind them. When doing that, you end up just learning a set of technologies without deeper meaning. One example of such a pattern is the dependency injection pattern as seen in frameworks like Spring Framework (Java), Quarkus (Java), and Angular (JavaScript). Focus on learning the patterns behind something, not just learning tons of technologies. If you know patterns and terms, it is easier to search for information on them. It is also more important that you have an understanding of the framework/library you are using (i.e, what it does and the basics of how it works), than having used hundreds of them without any deeper understanding. Patterns is used in a broad sense here, as I'm including both concepts like dependency injection, and design patterns like the Builder-pattern (and other typical "gang of four design patterns").</li>
<li><b>Be curious!</b> A backend developer often models the world around us into code. To know what you are making, and to make it as good as possible, you should know your problem domain well. How else are you going to solve the customers needs with your software? Understanding both whats happening in the world, as well other fields than computers, will help you a lot.</li>
</ul>
</div>
</div>



<div id="outline-container-org18e5675" class="outline-2">
<h2 id="org18e5675">Learning list</h2>
<div class="outline-text-2" id="text-org18e5675">
</div>
<div id="outline-container-orgf68d349" class="outline-3">
<h3 id="orgf68d349">1. Complete basics</h3>
<div class="outline-text-3" id="text-orgf68d349">
<ul class="org-ul">
<li><b>Know you a programming language at a decent level:</b> You should be decently familiar with your programming language of choice. This includes basic problem solving, constructs unique to the language etc. You don't need to know everything. You don't have to know every little nook and cranny of the language, or be a master programmer. All of those things come with experience. Some popular languages (in enterprises) include Java, Kotlin, JavaScript, and Golang. If you specifically want to learn Kotlin, I have written <a href="https://themkat.net/2022/10/11/learning_kotlin_resources.html">a small guide to good learning resources</a>.</li>
<li><b>git:</b> git is a version control system that is mostly used for source code. If you want to learn the complete basics, I've heard that <a href="https://www.youtube.com/watch?v=tRZGeaHPoaw">Kevin Stratverts introduction video</a> is good. Other people might want to jump straight to <a href="https://git-scm.com/doc">the documentation</a>.</li>
<li><b>Know the basics of the command line:</b> A lot of people get away with using graphical utilities and their IDE (e.g, <a href="https://www.jetbrains.com/idea/">IntelliJ IDEA</a>) to avoid using the command line. I would argue that they would be much more productive if they just learned the command line. With the advent of DevOps in many companies, you will also get use for command line skills when creating container images, automating workflows etc. If you are a beginner to the command line, I have <a href="https://themkat.net/2021/10/02/no_nonsense_command_line.html">a beginner article on getting started with it</a>.</li>
</ul>
</div>
</div>
