org/_posts/2023-08-18-backend_dev_job_howto.org
*** 2. Next steps - The bread and butter
The following are some of the concepts a backend developer should know, and that will help you in becoming one. It is not necessary to know everything before starting a job though. Knowing as much about these as possible, and how it relates to your job, might help your chances on getting a job if there is competition. Don't be scared if you don't know everything! It is okay to learn some of it on the job as well.


- *API:*  Application programming interface. You can oversimplify it a bit, and think of it as the interface we use to communicate with an external system, process or library. A common example is using HTTP to fetch JSON data from a server. This is essentially what most backend developers does: create APIs to fetch JSON data that a frontend (i.e, website, mobile application or similar) or other server can use. Often this is called a REST API, though [[https://aws.amazon.com/what-is/restful-api/][REST APIs]] also come with some architectural constraints. You should know what a REST API is, and the HTTP verbs you use when creating them (e.g, POST, GET, PUT etc.). 
- *Databases:* What a database is, and basic concepts surrounding them. You should at least know what a [[https://cloud.google.com/learn/what-is-a-relational-database][relational database]] is, as well as how we work with them. Some minor knowledge on [[https://www.w3schools.com/sql/default.asp][basic SQL]] for querying the databases is also very useful to know. Knowing and having played with a few different types of databases might also help. E.g, PostgreSQL vs MongoDB to see different approaches (relational vs newer NoSQL document storage).  
- *Software testing:*  [[https://www.freecodecamp.org/news/software-testing-for-beginners/][Software testing]] has become its own field, and you should know at least know why we test our code and a few test classifications. You will also need to write tests even if you are not a software tester, though mostly [[https://www.freecodecamp.org/news/unit-tests-explained/][unit tests]]. How you write these unit tests will vary depending on your language and environment. For the Java platform (aka programs running on the Java Virtual Machine), almost everyone uses [[https://junit.org/junit5/][JUnit]]. When you have read a bit about testing, you will probably start thinking about how many you should write. How many full end to end tests do we need? And how many unit tests? Many best practices refer to the [[https://learn.cypress.io/testing-foundations/the-testing-pyramid][test pyramid]], so you should at least know about it.
- *DevOps:* If you are working as a developer in 2000-current-year, you will undoubtedly hear the word DevOps at some point. To oversimplify, DevOps is the combination of Development and Operations. Usually this means that that developers have more responsibility for deployment of their systems, without the classical handover to operations at the end. Operations will often still collaborate and empower developers to do what they need though, so operations are not completely replaced like some people online believe. That being said, DevOps is one of the many misused buzzwords these days, and you may experience different interpretations of it in different companies. There are several important tools and concepts that have made DevOps possible: [[https://cloud.google.com/learn/what-are-containers][containers]] (you may have heard of [[https://www.docker.com/][Docker]]?), container orchestration tools like [[https://kubernetes.io/][Kubernetes]], and [[https://about.gitlab.com/topics/ci-cd/][CI/CD]] (continuous integration / continuous delivery) automation like [[https://github.com/features/actions][Github Actions]]. While there are much more that could be mentioned here, these are the most important concepts to know about in my view.
- *Various terms to learn the meaning of:* Learning a set of terms can help you have more clear discussions and make better (i.e, more relevant) search queries.
  - [[https://www.freecodecamp.org/news/a-quick-intro-to-dependency-injection-what-it-is-and-when-to-use-it-7578c84fa88f/][dependency injection]]
  - [[https://refactoring.guru/design-patterns][design patterns]]. Useful to know some common ones like Builder, Singleton, Visitor, Observer, and Factory method. (all described in the link given)
  - [[https://en.wikipedia.org/wiki/Create,_read,_update_and_delete][CRUD/CRUDL]] (create, read, update, delete, list). Way of describing basic set of operations. These terms are often used when planning or discussing APIs.
  - [[https://www.atlassian.com/agile/project-management/project-management-intro][agile vs. waterfall]] (software planning)

    
Even if you are learning theory, most of you will probably also want to experiment with actual technologies and frameworks. Below is a set of popular frameworks and libraries used in backend development these days. The first 3 are full blown frameworks, while the last is a more simplistic web server (that is still super useful for creating server applications!).  

- [[https://spring.io/][Spring Framework]] (Java), though you will probably want to use [[https://spring.io/projects/spring-boot][Spring Boot]] for newer projects.
- [[https://quarkus.io/][Quarkus]] (Java)
- [[https://learn.microsoft.com/en-us/aspnet/core/introduction-to-aspnet-core?view=aspnetcore-7.0][ASP.NET Core]] (C#)
- [[https://expressjs.com/][Express.js]] (webserver for Node.js)


