_posts/2023-08-18-backend_dev_job_howto.html


<div id="outline-container-org1cb4de4" class="outline-3">
<h3 id="org1cb4de4">2. Next steps - The bread and butter</h3>
<div class="outline-text-3" id="text-org1cb4de4">
<p>
The following are some of the concepts a backend developer should know, and that will help you in becoming one. It is not necessary to know everything before starting a job though. Knowing as much about these as possible, and how it relates to your job, might help your chances on getting a job if there is competition. Don't be scared if you don't know everything! It is okay to learn some of it on the job as well.
</p>


<ul class="org-ul">
<li><b>API:</b>  Application programming interface. You can oversimplify it a bit, and think of it as the interface we use to communicate with an external system, process or library. A common example is using HTTP to fetch JSON data from a server. This is essentially what most backend developers does: create APIs to fetch JSON data that a frontend (i.e, website, mobile application or similar) or other server can use. Often this is called a REST API, though <a href="https://aws.amazon.com/what-is/restful-api/">REST APIs</a> also come with some architectural constraints. You should know what a REST API is, and the HTTP verbs you use when creating them (e.g, POST, GET, PUT etc.).</li>
<li><b>Databases:</b> What a database is, and basic concepts surrounding them. You should at least know what a <a href="https://cloud.google.com/learn/what-is-a-relational-database">relational database</a> is, as well as how we work with them. Some minor knowledge on <a href="https://www.w3schools.com/sql/default.asp">basic SQL</a> for querying the databases is also very useful to know. Knowing and having played with a few different types of databases might also help. E.g, PostgreSQL vs MongoDB to see different approaches (relational vs newer NoSQL document storage).</li>
<li><b>Software testing:</b>  <a href="https://www.freecodecamp.org/news/software-testing-for-beginners/">Software testing</a> has become its own field, and you should know at least know why we test our code and a few test classifications. You will also need to write tests even if you are not a software tester, though mostly <a href="https://www.freecodecamp.org/news/unit-tests-explained/">unit tests</a>. How you write these unit tests will vary depending on your language and environment. For the Java platform (aka programs running on the Java Virtual Machine), almost everyone uses <a href="https://junit.org/junit5/">JUnit</a>. When you have read a bit about testing, you will probably start thinking about how many you should write. How many full end to end tests do we need? And how many unit tests? Many best practices refer to the <a href="https://learn.cypress.io/testing-foundations/the-testing-pyramid">test pyramid</a>, so you should at least know about it.</li>
<li><b>DevOps:</b> If you are working as a developer in 2000-current-year, you will undoubtedly hear the word DevOps at some point. To oversimplify, DevOps is the combination of Development and Operations. Usually this means that that developers have more responsibility for deployment of their systems, without the classical handover to operations at the end. Operations will often still collaborate and empower developers to do what they need though, so operations are not completely replaced like some people online believe. That being said, DevOps is one of the many misused buzzwords these days, and you may experience different interpretations of it in different companies. There are several important tools and concepts that have made DevOps possible: <a href="https://cloud.google.com/learn/what-are-containers">containers</a> (you may have heard of <a href="https://www.docker.com/">Docker</a>?), container orchestration tools like <a href="https://kubernetes.io/">Kubernetes</a>, and <a href="https://about.gitlab.com/topics/ci-cd/">CI/CD</a> (continuous integration / continuous delivery) automation like <a href="https://github.com/features/actions">Github Actions</a>. While there are much more that could be mentioned here, these are the most important concepts to know about in my view.</li>
<li><b>Various terms to learn the meaning of:</b> Learning a set of terms can help you have more clear discussions and make better (i.e, more relevant) search queries.
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/news/a-quick-intro-to-dependency-injection-what-it-is-and-when-to-use-it-7578c84fa88f/">dependency injection</a></li>
<li><a href="https://refactoring.guru/design-patterns">design patterns</a>. Useful to know some common ones like Builder, Singleton, Visitor, Observer, and Factory method. (all described in the link given)</li>
<li><a href="https://en.wikipedia.org/wiki/Create,_read,_update_and_delete">CRUD/CRUDL</a> (create, read, update, delete, list). Way of describing basic set of operations. These terms are often used when planning or discussing APIs.</li>
<li><a href="https://www.atlassian.com/agile/project-management/project-management-intro">agile vs. waterfall</a> (software planning)</li>
</ul></li>
</ul>


<p>
Even if you are learning theory, most of you will probably also want to experiment with actual technologies and frameworks. Below is a set of popular frameworks and libraries used in backend development these days. The first 3 are full blown frameworks, while the last is a more simplistic web server (that is still super useful for creating server applications!).  
</p>

<ul class="org-ul">
<li><a href="https://spring.io/">Spring Framework</a> (Java), though you will probably want to use <a href="https://spring.io/projects/spring-boot">Spring Boot</a> for newer projects.</li>
<li><a href="https://quarkus.io/">Quarkus</a> (Java)</li>
<li><a href="https://learn.microsoft.com/en-us/aspnet/core/introduction-to-aspnet-core?view=aspnetcore-7.0">ASP.NET Core</a> (C#)</li>
<li><a href="https://expressjs.com/">Express.js</a> (webserver for Node.js)</li>
</ul>
</div>
</div>
