org/_posts/2023-08-18-backend_dev_job_howto.org
*** 3. Going a bit above and beyond
I'm in no way saying these are super advanced topics, though they might seem that way if you are a beginner. What I'm saying is that a lot of people applying for a job don't a lot about these, especially those with less experience. Knowing a few will help you, as you will probably work with these topics (especially in a decently modern software company).


All of these will probably be considered basic knowledge for a more senior position. 


- *Software architecture:* Includes many topics ranging from how a system should work functionally, technologies used, code structure etc. One common approach in software architecture is to separate the pure technology code (database logic, web server logic etc.) from the business logic (e.g, create a customer, place an order etc.). This should then in theory make the code easier to work with and change over time. There are many other considerations that can be made, like how the systems should communicate (i.e, REST APIs, events, file reading etc.). Knowing a bit about [[https://martinfowler.com/architecture/][software architecture]] can help you better understand the various systems that you work with. A lot of people have heard about [[https://microservices.io/][Microservice architecture]], but have you heard about terms like [[https://priyalwalpita.medium.com/software-architecture-patterns-layered-architecture-a3b89b71a057][layered architecture]] or [[https://blog.cleancoder.com/uncle-bob/2012/08/13/the-clean-architecture.html][clean architecture]]?
- *Events and event driven architectures:* When communicating between systems, the classical approach was to do this communications synchronously. We do a call to a service we want to communicate with, and wait for results. Events are another approach where we send data asynchronously! We send an event that something has happened, and interested parties pick this up and handle it their way. Architectures that use this as a main building block is often called [[https://aws.amazon.com/event-driven-architecture/][event driven architecture]]. This leads to different ways of creating software systems. Many enterprises are starting to use concepts like these more and more, so knowing a thing or two about them can be beneficial. Relevant technologies include [[https://kafka.apache.org/][Apache Kafka]] and [[https://www.rabbitmq.com/][RabbitMQ]].
- *Kubernetes:* Learning the ins and outs of Kubernetes can help you a lot, especially if you have to debug issues. What has helped me most in my job is the following:
  - Listing resources (pods, services, custom resources etc.)
  - Listing events in a namespace. These include allocation of resources, failure to start, health checks failing etc.
  - Describing pods using =kubectl describe pod=. This helps tremendously when you want to see metadata, events and more about your pod. Most of my startup issues have been solved by details from a quick describe command!
  - Running commands in pods using =kubectl exec=  
  - [[https://www.redhat.com/en/topics/containers/what-is-a-kubernetes-operator][Operators]], what they are and what they do.

